Перем Cmd;
Перем Connect;

&НаКлиенте
Процедура Обслуживание(Команда)
	ОстановитьСлужбу(Сервер1с);
	ВыполнитьОбслуживаниеSQL(1);
	ЗапуститьСлужбу(Сервер1с);
	ВыполнитьОбслуживаниеSQL(2);
	ВыполнитьОбслуживаниеSQL(3);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбслуживаниеSQL(шаг)
	ПодключитьSQL();
	ТекстSQL = ПолучитьТекстОбсуживания(шаг);
				
	Рез = ВыполнитьЗапрос(ТекстSQL);
	Если Рез = Неопределено Тогда 
		Возврат;         
	Иначе
		СообщениеОПроцессе("Выполнен шаг - " + шаг + Символы.ПС + "Результат: " + Рез, Истина);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТекстОбсуживания(шаг)
	Обработка =  РеквизитФормыВЗначение("Объект");
	
	Если шаг = 1 Тогда 
		Текст = Обработка.ПолучитьМакет("ReindexRebild").ПолучитьТекст();
	ИначеЕсли Шаг = 2 Тогда
		Текст = Обработка.ПолучитьМакет("sp_updatestats").ПолучитьТекст();
	ИначеЕсли Шаг = 3 Тогда
		Текст = Обработка.ПолучитьМакет("FREEPROCCACHE").ПолучитьТекст();
	КонецЕсли;
	Текст = СтрЗаменить(Текст,"SQLBASENAME",БазаСКУЛЬ);
	Возврат текст;
КонецФункции

Процедура СообщениеОПроцессе(ТекстСообщения, ВыводитьВремя = Ложь) 
	Сообщить(ТекстСообщения + " [" + ?(ВыводитьВремя, ТекущаяДата(),"") + "]");
КонецПроцедуры

Функция ВыполнитьЗапрос(ТекстSQL)
	Перем Строк;
	
	Попытка
		Cmd.CommandText = ТекстSQL;;
		//RS = Cmd.Execute(Строк);
		Cmd.Execute(Строк);
	Исключение
		СообщениеОПроцессе(ОписаниеОшибки() + Символы.ПС + "Запрос :   " + ТекстSQL);
		Возврат Неопределено;
	КонецПопытки;
		
	Возврат Строк;
	
КонецФункции

Процедура ПодключитьSQL()
	
	//СтруктураИБ = ПолучитьСтруктуруХраненияБазыДанных(, Истина);
	
	
	Если НЕ Соединение_ИБ() Тогда 
			СообщениеОПроцессе(ОписаниеОшибки());
			Возврат;
	КонецЕсли;
    Cmd = Новый COMОбъект("ADODB.Command");
	Cmd.ActiveConnection = Connect;
	Cmd.CommandTimeout = 0;

КонецПроцедуры

&НаСервере
Процедура ОстановитьСлужбу(Сервер)
	WinMGMT = ПолучитьCOMОбъект("winmgmts:\\" + Сервер + "\root\cimv2");
	Win32_Service = WinMGMT.ExecQuery("SELECT * FROM Win32_Service");
	
	Для Каждого Service ИЗ Win32_Service Цикл
		Если Service.Name = ИмяСлужбы1с Тогда
			Service.StopService();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция Соединение_ИБ(ВремяОжидания=60) Экспорт  
	//to do: переписать функцию
	Если НЕ Connect = Неопределено Тогда 
		Возврат Истина;
	КонецЕсли;
	
	//СоединениеУстановлено = Ложь;

	Connect						= Новый COMОбъект("ADODB.Connection");
	Connect.ConnectionTimeOut	= ВремяОжидания;
	Connect.CursorLocation		= 3;
	
	СтрокаСоединенияИБ	= СтрокаСоединенияИнформационнойБазы();
	ПозицияИмяСервера	= Найти(СтрокаСоединенияИБ,"Srvr=""");
	Если ПозицияИмяСервера > 0 Тогда
		сСтрСоед		= Сред(СтрокаСоединенияИБ, ПозицияИмяСервера + 6);
		нКовычка		= Найти(сСтрСоед,"""");
		ИмяСервера		= Лев(сСтрСоед,нКовычка - 1);
		нДвоеточие		= Найти(ИмяСервера,":");
		Если нДвоеточие = 0 Тогда
			//Порт		= 1541;
		Иначе
			//Порт		= Сред(ИмяСервера,нДвоеточие + 1);
			ИмяСервера	= Лев(ИмяСервера,нДвоеточие - 1);
		КонецЕсли;
		сСтрСоед		= Сред(сСтрСоед,нКовычка + 1);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ПозицияИмяБД		= Найти(сСтрСоед,"Ref=""");
	Если ПозицияИмяБД > 0 Тогда
		сСтрСоед		= Сред(сСтрСоед,ПозицияИмяБД + 5);
		нКовычка		= Найти(сСтрСоед,"""");
		//ИмяБД			= Лев(сСтрСоед,нКовычка - 1);
		сСтрСоед		= Сред(сСтрСоед,нКовычка + 1);
	КонецЕсли;
	
	Попытка
		Connect.Open(СтрокаСоединения);
		Возврат Истина;
		
	Исключение
		Connect = Неопределено;
		Сообщить("Ошибка подключения к Sql
		|" + ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗапуститьСлужбу(Сервер)
	WinMGMT = ПолучитьCOMОбъект("winmgmts:\\" + Сервер + "\root\cimv2");
	Win32_Service = WinMGMT.ExecQuery("SELECT * FROM Win32_Service");
	
	Для Каждого Service ИЗ Win32_Service Цикл
		Если Service.Name = ИмяСлужбы1с Тогда
			Service.StartService();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СерверСКУЛЬ = "SQL-1с-Server01";
	БазаСКУЛЬ = "SQL_base";
	Сервер1с = "SQL-1с-Server01";
	ИмяСлужбы1с = "1C:Enterprise 8.3 Server Agent (x86-64)";
	СобратьСтрокуСоединения();
КонецПроцедуры

&НаКлиенте
Процедура СерверСКУЛЬПриИзменении(Элемент)
	СобратьСтрокуСоединения();
КонецПроцедуры


&НаСервере
Процедура СобратьСтрокуСоединения()
	СтрокаСоединения = "Provider=SQLOLEDB.1;Integrated Security = SSPI;Initial Catalog=" + СерверСКУЛЬ + ";Data Source=" + БазаСКУЛЬ;
КонецПроцедуры

&НаКлиенте
Процедура БазаСКУЛЬПриИзменении(Элемент)
	СобратьСтрокуСоединения();
КонецПроцедуры


